{"keras_version": "2.0.9", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 20, 20, 3], "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activation": "relu", "bias_regularizer": null, "name": "conv2d_1", "data_format": "channels_last", "filters": 32, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"padding": "valid", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Conv2D", "config": {"padding": "valid", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_regularizer": null, "name": "conv2d_3", "data_format": "channels_last", "filters": 128, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.25, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.5, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_2", "bias_regularizer": null, "kernel_regularizer": null}}]}