{"keras_version": "2.0.9", "backend": "tensorflow", "config": [{"config": {"kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "dtype": "float32", "use_bias": true, "filters": 32, "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "strides": [1, 1], "name": "conv2d_4", "batch_input_shape": [null, 20, 20, 3], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "use_bias": true, "filters": 64, "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "strides": [1, 1], "name": "conv2d_5", "kernel_constraint": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "noise_shape": null, "seed": null, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "use_bias": true, "filters": 128, "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "strides": [1, 1], "name": "conv2d_6", "kernel_constraint": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "trainable": true, "noise_shape": null, "seed": null, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "use_bias": true, "units": 1024, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "noise_shape": null, "seed": null, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "use_bias": true, "units": 6, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential"}